In [1]:
import pandas as pd
import numpy as np

## Data Manipulation

1.

In [2]:
#Create a new empty dataframe to store the data.
generation_monthly = pd.DataFrame()

In [3]:
#Load the data from the xlsx file and exclude those row that are nit useful.
for i in range(0, 5):#There are two iterations because different years have different useless rows.
    new_data = pd.read_excel('../data/generation_monthly.xlsx', i, header = None, skiprows = 1)
    generation_monthly = generation_monthly.append(new_data)
for j in range(5, 14):
    new_data = pd.read_excel('../data/generation_monthly.xlsx', j, header = None, skiprows = 5)
    generation_monthly = generation_monthly.append(new_data)

In [4]:
#Assign the proper column names and reset the index.
generation_monthly = generation_monthly.rename(columns={0: 'YEAR', 1: 'MONTH', 2: 'STATE', 3: 'TYPE_OF_PRODUCER', 4: 'ENERGY_SOURCE', 5: 'GENERATION\n(Megawatthours)',}).reset_index()

In [5]:
#Select the rows that contains VA and total generation.
generation_monthly = generation_monthly.query('STATE in ["VA"] and ENERGY_SOURCE in ["Total"] and TYPE_OF_PRODUCER in ["Total Electric Power Industry"]')

In [6]:
#Convert the date to datetime format.
generation_monthly["DATE"] = pd.to_datetime(generation_monthly.YEAR.astype(str) + '/' + generation_monthly.MONTH.astype(str) )

In [7]:
#Select the columns we need.
generation_monthly = generation_monthly[['DATE', 'GENERATION\n(Megawatthours)']]

In [8]:
#Take a look.
generation_monthly

             DATE  GENERATION\n(Megawatthours)
1408   2001-01-01                    7117068.0
3079   2001-02-01                    5894142.0
4754   2001-03-01                    6358233.0
6431   2001-04-01                    6108458.0
8110   2001-05-01                    5592002.0
...           ...                          ...
452053 2020-08-01                   10066339.0
454175 2020-09-01                    7691990.0
456296 2020-10-01                    7007291.0
458418 2020-11-01                    6938746.0
460539 2020-12-01                    8847200.0

[240 rows x 2 columns]

2.

In [9]:
#Load the data from the xlsx file
price = pd.read_excel('../data/sales_revenue.xlsx', skiprows = 2)[['Year', 'Month', 'State', 'Cents/kWh.5']]

In [10]:
#Drop the last row because it contains nothing useful.
price.drop(price.tail(1).index,inplace=True)

In [11]:
#convert year to int for later datetime transform.
price['Year'] = price['Year'].astype('int')

In [12]:
#Select the rows that contains VA and year between 2000 and 2021.
price = price.query('State in ["VA"] and Year > 2000 and Year <2021')

In [13]:
#Convert the date to datetime format.
price["DATE"] = pd.to_datetime(price.Year.astype(str) + '/' + price.Month.astype('int').astype(str) )

In [14]:
#Select the columns we need and rename one of the col name.
price = price[['DATE', 'Cents/kWh.5']].rename(columns={'Cents/kWh.5': 'PRICE(Cents/kWh.5)'})

In [15]:
#Take a look.
price

            DATE  PRICE(Cents/kWh.5)
6777  2001-01-01                5.86
6828  2001-02-01                6.03
6879  2001-03-01                6.06
6930  2001-04-01                6.05
6981  2001-05-01                6.17
...          ...                 ...
18762 2020-08-01                9.50
18813 2020-09-01                9.12
18864 2020-10-01                8.77
18915 2020-11-01                8.83
18966 2020-12-01                9.12

[240 rows x 2 columns]

3.

In [16]:
#Create a new empty dataframe to store the data.
consumption_monthly = pd.DataFrame()

In [17]:
#Load the data from the xlsx file and exclude those row that are nit useful.
for i in range(0, 2):#There are two iterations because different years have different useless rows.
    new_data = pd.read_excel('../data/consumption_monthly.xlsx', i ,header = None, skiprows = 1)
    consumption_monthly = consumption_monthly.append(new_data)
for j in range(2, 11):
    new_data = pd.read_excel('../data/consumption_monthly.xlsx', j, header = None, skiprows = 5)
    consumption_monthly = consumption_monthly.append(new_data)

In [18]:
#Assign the proper column names and reset the index.
consumption_monthly = consumption_monthly.rename(columns={0: 'YEAR', 1: 'MONTH', 2: 'STATE', 3: 'TYPE_OF_PRODUCER', 4: 'ENERGY_SOURCE (UNITS)', 5: 'CONSUMPTION',}).reset_index()

In [19]:
#Convert the date to datetime format.
consumption_monthly["DATE"] = pd.to_datetime(consumption_monthly.YEAR.astype(str) + '/' + consumption_monthly.MONTH.astype(str) )

In [20]:
#Select the rows that contains VA and total consumption of fossil fuels.
consumption_monthly = consumption_monthly.query('STATE in ["VA"] and TYPE_OF_PRODUCER in ["Total Electric Power Industry"]')

In [21]:
#Select the rows we need and pivot from ling to wide.
consumption_monthly = consumption_monthly[['DATE', 'ENERGY_SOURCE (UNITS)', 'CONSUMPTION']].pivot(index = 'DATE', columns='ENERGY_SOURCE (UNITS)', values='CONSUMPTION').reset_index().fillna(0)

In [22]:
#Take a look.
consumption_monthly

ENERGY_SOURCE (UNITS),DATE,Coal (Short Tons),Natural Gas (Mcf),Other Gases (Billion BTU),Petroleum (Barrels)
0,2001-01-01,1394053.0,1744687.0,0.0,1019395.0
1,2001-02-01,1225213.0,809796.0,0.0,525230.0
2,2001-03-01,1312509.0,732833.0,0.0,1170501.0
3,2001-04-01,1142288.0,1217777.0,0.0,1085490.0
4,2001-05-01,1129454.0,1012305.0,0.0,400489.0
...,...,...,...,...,...
235,2020-08-01,336033.0,45822538.0,0.0,78779.0
236,2020-09-01,69319.0,36587665.0,0.0,69386.0
237,2020-10-01,27096.0,32076827.0,0.0,32886.0
238,2020-11-01,93992.0,25479817.0,0.0,54436.0
239,2020-12-01,284981.0,34488484.0,0.0,65623.0

4.

In [23]:
#Read the data from csv file.
average_temperature = pd.read_csv('../data/average_temperature.csv')

In [24]:
#Drop the rows that contains useless information.
average_temperature.drop(average_temperature.head(3).index,inplace=True)
average_temperature.drop(average_temperature.tail(1).index,inplace=True)

In [25]:
#Convert the date to datetime format.
average_temperature['DATE'] = pd.to_datetime(average_temperature['Virginia'], format="%Y%m")

In [26]:
#Select the columns we need and rename one of the col name.
average_temperature = average_temperature[['DATE', ' Average Temperature']].rename(columns={' Average Temperature': 'AverageTemperature'})

In [27]:
#Take a look.
average_temperature

          DATE AverageTemperature
3   2001-01-01               34.3
4   2001-02-01               41.2
5   2001-03-01               42.0
6   2001-04-01               56.6
7   2001-05-01               63.0
..         ...                ...
238 2020-08-01               75.5
239 2020-09-01               66.4
240 2020-10-01               59.0
241 2020-11-01               51.3
242 2020-12-01               38.4

[240 rows x 2 columns]

5.

In [28]:
#Read the data from csv file.
precipitation = pd.read_csv('../data/precipitation.csv')

In [29]:
#Drop the rows that contains useless information.
precipitation.drop(precipitation.head(3).index,inplace=True)
precipitation.drop(precipitation.tail(1).index,inplace=True)

In [30]:
#Convert the date to datetime format.
precipitation['DATE'] = pd.to_datetime(precipitation['Virginia'], format="%Y%m")

In [31]:
#Select the columns we need and rename one of the col name.
precipitation = precipitation[['DATE', ' Precipitation']].rename(columns={' Precipitation': 'Precipitation'})

In [32]:
#Add a columns named covid to indicate whether that month has covid. We can add it to any dataframe expect the one that is from google search. Add it here just for convenience.
precipitation['covid'] = np.where(precipitation['DATE'] > '2020-02-01', 1, 0)

In [33]:
#Take a look.
precipitation

          DATE Precipitation  covid
3   2001-01-01          2.27      0
4   2001-02-01          2.01      0
5   2001-03-01          4.45      0
6   2001-04-01          1.64      0
7   2001-05-01          4.88      0
..         ...           ...    ...
238 2020-08-01          8.20      1
239 2020-09-01          6.31      1
240 2020-10-01          5.07      1
241 2020-11-01          5.15      1
242 2020-12-01          5.14      1

[240 rows x 3 columns]

6.

In [34]:
#Read the data from csv file.
multiTimeline = pd.read_csv('../data/multiTimeline.csv').reset_index()

In [35]:
#Drop the rows that contains useless information.
multiTimeline.drop(multiTimeline.head(1).index,inplace=True)
multiTimeline.drop(multiTimeline.tail(11).index,inplace=True)

In [36]:
#Convert the date to datetime format.
multiTimeline['DATE'] = pd.to_datetime(multiTimeline['index'])

In [37]:
#Rename the column and select the columns we need.
multiTimeline = multiTimeline.rename(columns={'Category: All categories': 'internet_search'})[['DATE', 'internet_search']]

In [38]:
#Take a look.
multiTimeline

          DATE internet_search
1   2004-01-01              43
2   2004-02-01              43
3   2004-03-01              42
4   2004-04-01              46
5   2004-05-01              42
..         ...             ...
200 2020-08-01              72
201 2020-09-01              67
202 2020-10-01              69
203 2020-11-01              69
204 2020-12-01              75

[204 rows x 2 columns]

7.

In [39]:
#Merge them all together.
full_data = generation_monthly.merge(consumption_monthly, on='DATE').merge(multiTimeline,on='DATE', how = "left").merge(average_temperature, on='DATE').merge(precipitation, on='DATE').merge(price, on='DATE')

In [40]:
#Take a look.
full_data

,DATE,GENERATION\n(Megawatthours),Coal (Short Tons),Natural Gas (Mcf),Other Gases (Billion BTU),Petroleum (Barrels),internet_search,AverageTemperature,Precipitation,covid,PRICE(Cents/kWh.5)
0,2001-01-01,7117068.0,1394053.0,1744687.0,0.0,1019395.0,NaN,34.3,2.27,0,5.86
1,2001-02-01,5894142.0,1225213.0,809796.0,0.0,525230.0,NaN,41.2,2.01,0,6.03
2,2001-03-01,6358233.0,1312509.0,732833.0,0.0,1170501.0,NaN,42.0,4.45,0,6.06
3,2001-04-01,6108458.0,1142288.0,1217777.0,0.0,1085490.0,NaN,56.6,1.64,0,6.05
4,2001-05-01,5592002.0,1129454.0,1012305.0,0.0,400489.0,NaN,63.0,4.88,0,6.17
...,...,...,...,...,...,...,...,...,...,...,...
235,2020-08-01,10066339.0,336033.0,45822538.0,0.0,78779.0,72,75.5,8.20,1,9.50
236,2020-09-01,7691990.0,69319.0,36587665.0,0.0,69386.0,67,66.4,6.31,1,9.12
237,2020-10-01,7007291.0,27096.0,32076827.0,0.0,32886.0,69,59.0,5.07,1,8.77
238,2020-11-01,6938746.0,93992.0,25479817.0,0.0,54436.0,69,51.3,5.15,1,8.83
239,2020-12-01,8847200.0,284981.0,34488484.0,0.0,65623.0,75,38.4,5.14,1,9.12